const recipes = [

  {
    id: "ketchup",
    title: "Кетчуп",
    image: "images/ketchup.jpg",
    sections: [
      {
        subtitle: "Продукти",
        items: [
          "10 литра дом. сок",
          "1,5 каф.ч. брашно",
          "200 мл. оцет",
          "2 ч.л. червен пипер",
          "5-6 с.л. сол",
          "0,5 кг. захар"
        ]
      },
      {
        subtitle: "Подправки",
        items: [
          "1 каф.л. синап",
          "1 ч.л. кимион",
          "2 ч.л. чубрица",
          "1 ч.л. индийско орехче",
          "1 каф.л. черен пипер"
        ]
      }
    ],
    steps:
      "Всичко се поставя и разбърква добре в голям съд." +
      "Бърка се непрестанно до балончета." +
      "Добавя се подправката и се бърка още 10–15 мин."
  },

  {
    id: "pancakes-marinated-pears",
    title: "Палачинки с мариновани круши",
    image: "images/pancakes-marinated-pears.jpg",
    sections: [
      {
        subtitle: "Тесто",
        items: [
          "прясно мляко - 360 мл",
          "яйца - 3 бр",
          "захар - 40 гр",
          "сол - 2 гр",
          "масло - 85 гр",
          "брашно - 175 гр",
          "коняк - 10 мл",
          "ванилия (есенция)"
        ]
      },
      {
        subtitle: "За крушите",
        items: [
          "круши - 2 бр",
          "бяло вино - 100 мл",
          "захар - 80 гр",
          "портокал - 1 бр",
          "кардамон"
        ]
      },
      {
        subtitle: "За гарниране",
        items: [
          "портокали - 2 бр"
        ]
      }
    ],
    steps:
      "Мариноване на обелените и нарязани на кубчета круши,\n" +
      "в топлата марина от предвидените продукти (мариноват се със захар).\n" +
      "Приготвяне на рядко палачинково тесто от предвидените продукти.\n" +
      "Прецеждане. Изпържване на палачинки. Оформяне на палачинките\n" +
      "с плънката и завързване с портокалова кора.\n\n" +
      "!!! Може да се подготви канапе от сирена:\n" +
      "- сирене Бри или Камембер 75 гр\n" +
      "- Крема сирене 50 гр\n" +
      "- сметана животинска 50 гр\n" +
      "- пудра захар 25 гр\n" +
      "Пасира се"
  },

  {
    id: "truffles-caramel",
    title: "Трюфели с дъх на карамел",
    image: "images/truffles-caramel.jpg",
    sections: [
      {
        subtitle: "За карамела",
        items: [
           "захар - 75 гр",
            "вода - 25 мл",
            "глюкоза - 15 гр",
            "масло - 15 гр",
            "животинска сметана - 30 мл"
        ]
      },
      {
        subtitle: "За ганаша",
        items: [
          "животинска сметана - 125 мл",
          "млечен шоколад - 300 гр"
        ]
      }
    ],
    steps:
        "Приготвяне на карамела:\n" + 
        "Карамелизиране на захарта и водата. Добавяне на глюкозата, маслото и накрая предвиденото количество сметана.\n" +
        "Приготвяне на ганаш:\n" +
        "Смесване на двете смеси и охлаждане. Оформяне на трюфели. Тумкване в темпериран шоколад."
  },

  {
    id: "truffles-coffee",
    title: "Трюфели с дъх на кафе",
    image: "images/truffles-coffee.webp",
    sections: [
      {
        subtitle: "За редукцията",
        items: [
          "захар - 15 гр",
          "вода - 75 мл",
          "нес кафе - 10 гр",
          "кардамон",
          "глюкоза - 30 мл"
        ]
      },
      {
        subtitle: "За ганаша",
        items: [
          "животинска сметана - 125 мл",
          "черен шоколад - 225 гр"
        ]
      }
    ],
    steps:
      "Кипване на водата със захарта. Добавяне на нес кафе, кардамон и редуциране на сместта до 35-40 мл. " +
      "Прибавяне на глюкозата.\n" +
      "Приготвяне на ганащ:\n" +
      "Смесване на двете смеси и охлаждане. Оформяне на трюфели. Потапяне в темпериран шоколад."
  },

  {
    id: "saint-honore-cake",
    title: "Торта „Сен О норе“",
    image: "images/saint-honore-cake.jpg",
    sections: [
      {
        subtitle: "Рецепта",
        items: [
          "платки от многолисно тесто - 2 бр",
          "профитероли (полуфабрикат) - 20 бр",
          "основен ванилов крем (виж рецептата на стр. 18)"
        ]
      },
      {
        subtitle: "За крема",
        items: [
          "ванилов крем - 500 гр",
          "крема сирене - 150 гр",
          "сметана смес - 80 гр",
          "пудра захар - 100 гр",
          "желатин - 5 гр",
          "Мента",
          "Бакарди"
        ]
      },
      {
        subtitle: "За сиропа",
        items: [
          "вода - 250 мл",
          "захар - 80 гр",
          "коняк - 40 мл"
        ]
      },
      {
        subtitle: "За мекият карамел",
        items: [
          "захар - 250 гр",
          "мед - 20 гр",
          "масло - 35 мл"
        ]
      },
      {
        subtitle: "Карамел за декорация",
        items: [
          "захар - 200 гр",
        ]
      }
    ],
    steps:
      "Изрязване на платката. Замразяване. Надупчване и изпичане на 220 градуса до златист цвят. " +
      "Напълване на профитролите с крем (виж стр. 18). Охлаждане. Приготвяне на сиропа.\n" +
      "Препарация на крема: ваниловия крем се избива на миксера. Прибавя се кремата сирене, течната сметана и пудрата захар. " +
      "Добавя се предварително обработения желатин, разтопен и темпериран с ликьор, и част от крема. " +
      "Накрая се овкусява с накълцаните листа мента.\n" +
      "Сглобяване на основата: обличане на ринга с ацетатна лента. Поставяне на платката, трампиране със сиропа. " +
      "Подреждане на напълнените с крем профитероли и тумкването им в мек карамел. Запълване на височината на борда. " +
      "Запълване на тортата основа с готовия крем на половинат на височината на борда. Поставяне на втората платка, " +
      "трампиране, запълване с крем. Охлаждане.\n" +
      "!!! Тортата се оформя и се украсява с останалия карамел. Отгоре може да се украси с мини профитероли и " +
      "карамелова украса, изработена от карамела за декорация."
  },

  {
    id: "brownies-raspberry-mousse",
    title: "Шоколадов браунис с малинов мус",
    image: "images/brownies-raspberry-mousse.jpg",
    sections: [
      {
        subtitle: "За тава с размери 20/30 см",
        items: [
          "брашно - 85 гр",
          "какао 22% - 85 гр",
          "захар - 250 гр",
          "масло - 330 гр",
          "яйца - 4 бр",
          "ванилия течна - 1 бр",
          "черен шоколад - 250 гр",
          "орехови ядки - 130 гр",
          "пудра захар за поръсване"
        ]
      },
      {
        subtitle: "Малинов мус",
        items: [
          "жълтъци - 4 бр",
          "белтъци - 4 бр",
          "захар - 100 гр",
          "сметана смес - 250 гр",
          "желатин - 10 гр"
        ]
      },
      {
        subtitle: "Малинова редукция",
        items: [
          "малини замразени - 350 гр",
          "захар - 80 гр"
        ]
      }
    ],
    steps:
      "Пресяване на брашното и какаово заедно. Разтопяване на шоколада. Избиване на яйцата до побеляване " +
      "със захарта, ароматизиране с ванилия. Прибавяне на разтопеното масло, което е на стайна температура. " +
      "Добавяне на брашното, какаото и шоколада. Последно се прибавят ореховите ядки. Изсипва се сместта в тава, " +
      "Покрита с хартия за печене. Изпичане в зягрята фурна на 180 градуса за около 25 минути. Охлаждане. Замразяване.\n" +
      "За муса:\n" +
      "Приготвяне на малиновата редукция. Охлаждане. Избиване на сметаната. Разбиване на жълтъците с 1/3 от захарта. " +
      "Разбиване на белтъците на твърди връхчета с останалото количество захар. Към избитите жълтъци се прибавя охладената " +
      "редукция, обработения желатин, след това сметаната и накрая избития белтък."
  },

  {
    id: "sponge-cake-layers",
    title: "Пандишпанови блатове",
    image: "images/sponge-cake-layers.jpg",
    sections: [
      {
        subtitle: "Продукти за 1 бр блат (24 см) или два средни ринга (18 см)",
        items: [
          "белтък - 8 бр",
          "захар - 165 гр",
          "жълтъл - 8 бр",
          "брашно - 165 гр",
          "!!! От брашното се намалява съответното количество, когато се добавят какао или ядки"
        ]
      }
    ],
    steps:
      "Разделяне на жълтъци от белтъци. Избиване на жълтъците с 1/3 от захарта. Избиване на белтъците с 2/3 от захарта. " +
      "Прибавяне към избитите жълтъци на половината от сухата смес и поливината от избитите белтъци. След смесването им, " +
      "последователно добавяне на останалите части брашно и избитите белтъци. Леко разбъркване, до получаване на еднородна " +
      "въздушна маса. Разделяне в предварително подготвените форми, като сместа леко се издърпва от центъра на ринга към борда. " +
      "Изпичане при температура 180 градуса за 35 минути." +
      "\n\n!!! Не се пече през цялото време на тези градуси. А само първите 15-20 минути. Докато хване лек загар отгоре. " +
      "После се намалява на 170 градуса, да се доизсуши. Готовите блатове могат да се съхраняват замразени до 3 месеца " +
      "във фризер, добре опаковани."
  },

  {
    id: "chocolate-souffle",
    title: "Шоколадово суфле",
    image: "images/chocolate-souffle.jpeg",
    sections: [
      {
        subtitle: "Продукти за 10 порции",
        items: [
          "натурален шоколад - 200 гр",
          "масло - 125 гр",
          "пудра захар - 100 гр",
          "яйца - 6 бр",
          "брашно - 100 гр",
          "ванилия есенция",
          "!!! Ако се използва за мъфини се прибавя 10 гр бакпулвер"
        ]
      },
      {
        subtitle: "Глазура",
        items: [
          "пудра захар - 200 гр",
          "масло - 300 гр",
          "крема сирене - 400 гр"
        ]
      }
    ],
    steps:
      "Разтопяване на шоколада на входа на водна баня. Разтопяване и темпериране на маслото." +
      "Отделяне на белтъците от жълтъците на 3 от яйцата. Избиване на пстананлите 3 цели яйца с трите жълтъка, " +
      "с прибавяне на малка част (20 гр) от захарта. Пресяване на брешното. Избиване на белтъците (3 бр) на твърд " +
      "сняг с останалата част от захарта (80 гр). Към избитата яйчина смес (цели яйца и жълтъци) се пробавя маслото. " +
      "Към така получената еднородна смес се добавя разтопения шоколад, брашно и накрая, избитите на твърд сняг, белтъци. " +
      "Сместтан се разпределя в обработените форми за суфле. Охлаждане. Пече се на 200 градуса за 8-10 минути.\n" +
      "!!! Преди да бъде изпечено, суфлето може да се замрази и да се съхрани до 3 месеца. В този случай се пече " +
      "при 200 градуса за 10-15 минути.\n" +
      "В центъра може да се добави Фарс от сирена:\n" +
      "- синьо сирене - 80 гр\n" +
      "- крема сирене - 80 гр\n" +
      "- сметана животинска - 20 мл\n" +
      "Формуване на топчета. Замразяване."
  }

];
